# CREATE

- Create in CRUD is synonums to SQL INSERT statement
- SQL INSERT statement is used to add new records or rows of data into a database table
- allows you to specify the values to be inserted into each column of the table for the new record
- INSERT statement is a key component of the "Create" (C) operation in the CRUD (Create, Read, Update, Delete) paradigm
- https://sqlite.org/lang_insert.html
- basic syntax of the SQL INSERT statement is as follows:

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);
```

- Example:

```sql
INSERT INTO Employees (EmployeeID, FirstName, LastName, Department)
VALUES (101, 'John', 'Doe', 'Marketing');
```

- this SQL statement would insert a new record into the "Employees" table with the specified values for each column
- if the table has columns with default values, you might not need to provide a value for those columns in the INSERT statement
- if the table has an auto-incrementing primary key, you generally don't need to provide a value for that column, as the database system will automatically generate it

## Use DBeaver GUI to run insert statements

- connect chinook.db and run the collowing sql statement

```db
INSERT INTO artists (name)
VALUES('Bud Powell');
```
- because the ArtistId column is an auto-increment column, you can ignore it in the statement.


### Insert multiple rows into a table

```sql
INSERT INTO table_name (column1, column2 ,..)
VALUES 
   (value1,value2 ,...),
   (value1,value2 ,...),
    ...
   (value1,value2 ,...);
```
- each row of values represent one record or entity

```sql
INSERT INTO artists (name)
VALUES
	("Buddy Rich"),
	("Candido"),
	("Charlie Byrd");
```

### Insert default values

```sql
INSERT INTO artists DEFAULT VALUES;
```